# Условие 5
# Заявляется, что партия изготавливается со средним арифметическим 2,5 см.
# Проверить данную гипотезу, если известно, что размеры изделий
# подчинены нормальному закону распределения.
# Объем выборки 10, уровень статистической значимости 5%
# 2.51, 2.35, 2.74, 2.56, 2.40, 2.36, 2.65, 2.7, 2.67, 2.34

from math import sqrt


def average(list):
    sum = 0
    for i in list:
        sum = sum + i
    avr = sum / len(list)
    return avr


def unbiased_variance(list):    # Функция нахождения несмещенной дисперсии
    sum = 0
    for i in list:
        sum = sum + (i - average(list)) ** 2
    uv = sum / (len(list) - 1)
    return uv


m = 2.5
sample = [2.51, 2.35, 2.74, 2.56, 2.40, 2.36, 2.65, 2.7, 2.67, 2.34]
Zt = 1.645  # Значение по таблице, по уровню значимости 0,05

Zn = (average(sample) - m) / (sqrt(unbiased_variance(sample)) / sqrt(len(sample)))
if abs(Zn) < Zt:
    print(f"Утверждение верно, так как наблюдаемое значение: {round(Zn, 4)} меньше критической точки: {Zt}")
else:
    print(f"Утверждение НЕ верно, так как наблюдаемое значение: {Zn} больше критической точки: {Zt}")
