# Условие 3
# Рост дочерей 175, 167, 154, 174, 178, 148, 160, 167, 169, 170
# Рост матерей 178, 165, 165, 173, 168, 155, 160, 164, 178, 175
# Используя эти данные построить 95% доверительный интервал
# для разности среднего роста родителей и детей.

from numpy import mean, var
from math import sqrt
import scipy.stats as stats

x = [175, 167, 154, 174, 178, 148, 160, 167, 169, 170]
y = [178, 165, 165, 173, 168, 155, 160, 164, 178, 175]
Ta2 = stats.t.ppf(0.975, 18)

delta = mean(y) - mean(x)
d = (var(x, ddof=1) + var(y, ddof=1)) / 2
Se = sqrt(d / len(x) + d / len(y))

x1 = delta - Ta2 * Se
x2 = delta + Ta2 * Se
print(f"Доверительный интервал: [{round(x1, 2)}; {round(x2, 2)}]")
